//
//  main.cpp
//  Miao
//
//  Created by 杨光宇 on 15/3/13.
//  Copyright (c) 2015年 GuangYu Yang. All rights reserved.
//

#include <iostream>
#define 喵喵喵 main
#define 喵喵 int
#define 喵 (
#define 喵喵呜 )
#define 喵喵喵喵 {
#define 喵呜喵 }
#define 喵呜喵呜喵 printf
#define 呜 "\n"
#define 喵呜喵呜 return
#define 呜喵 0
#define 喵呜 ;
#include <stdio.h>

喵喵 喵喵喵 喵 喵喵呜
喵喵喵喵
喵呜喵呜喵 喵 "喵喵喵! " 呜 喵喵呜 喵呜
喵呜喵呜 呜喵 喵呜
喵呜喵

//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永无BUG
//
//
//
/**
 *
 *----------Dragon be here!----------/
 *      ┏┓     ┏┓
 *     ┏┛┻━━━━━┛┻┓
 *     ┃         ┃
 *     ┃   ━     ┃
 *     ┃ ┳┛  ┗┳  ┃
 *     ┃         ┃
 *     ┃   ┻     ┃
 *     ┃         ┃
 *     ┗━┓　　　┏━┛
 *       ┃　　　┃神兽保佑
 *       ┃　　　┃代码无BUG！
 *       ┃　　　┗━━━┓
 *       ┃         ┣┓
 *       ┃         ┏┛
 *       ┗┓┓┏━━━┳┓┏┛
 *        ┃┫┫   ┃┫┫
 *        ┗┻┛   ┗┻┛
 * ━━━━━━神兽出没━━━━━━
 */